---
kind: method
id: M:Autodesk.Revit.DB.ImageTypeOptions.SetExternalResourceReference(Autodesk.Revit.DB.ExternalResourceReference)
source: html/0b401f0d-2333-2686-254c-14003c967314.htm
---
# Autodesk.Revit.DB.ImageTypeOptions.SetExternalResourceReference Method

Update the external resource reference to an image.

## Syntax (C#)
```csharp
public void SetExternalResourceReference(
	ExternalResourceReference resourceReference
)
```

## Parameters
- **resourceReference** (`Autodesk.Revit.DB.ExternalResourceReference`) - An external resource reference to an image.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null